IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_gpio_ctrl_regs.xml
	<register id="GPBDIR" width="32" page="1" offset="0x4a" internal="0" description="GPIO B Direction (GPIO32 to GPIO63)">
		<bitfield id="GPIO32" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBPUD" width="32" page="1" offset="0x4c" internal="0" description="GPIO B Pull-Up Disable (GPIO32 to GPIO63) ">
		<bitfield id="GPIO32" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBINV" width="32" page="1" offset="0x50" internal="0" description="GPIO B Input Inversion (GPIO32 to GPIO63)">
		<bitfield id="GPIO32" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBODR" width="32" page="1" offset="0x52" internal="0" description="GPIO B Open Drain Output Mode (GPIO32 to GPIO63)">
		<bitfield id="GPIO32" description="Output Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Output Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Output Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Output Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Output Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Output Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Output Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Output Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Output Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Output Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Output Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Output Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Output Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Output Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Output Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Output Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Output Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Output Open-Drain control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Output Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Output Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Output Open-Drain control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Output Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Output Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Output Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Output Open-Drain control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Output Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
