IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_gpio_ctrl_regs.xml
	<register id="GPBGMUX1" width="32" page="1" offset="0x60" internal="0" description="GPIO B Peripheral Group Mux (GPIO32 to GPIO47)">
		<bitfield id="GPIO32" description="Defines pin-muxing selection for GPIO32" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Defines pin-muxing selection for GPIO33" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Defines pin-muxing selection for GPIO34" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Defines pin-muxing selection for GPIO35" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Defines pin-muxing selection for GPIO37" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Defines pin-muxing selection for GPIO39" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Defines pin-muxing selection for GPIO40" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Defines pin-muxing selection for GPIO41" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Defines pin-muxing selection for GPIO42" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Defines pin-muxing selection for GPIO43" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Defines pin-muxing selection for GPIO44" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Defines pin-muxing selection for GPIO45" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Defines pin-muxing selection for GPIO46" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Defines pin-muxing selection for GPIO47" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBGMUX2" width="32" page="1" offset="0x62" internal="0" description="GPIO B Peripheral Group Mux (GPIO48 to GPIO63)">
		<bitfield id="GPIO48" description="Defines pin-muxing selection for GPIO48" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Defines pin-muxing selection for GPIO49" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Defines pin-muxing selection for GPIO50" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Defines pin-muxing selection for GPIO51" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Defines pin-muxing selection for GPIO52" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Defines pin-muxing selection for GPIO53" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Defines pin-muxing selection for GPIO54" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Defines pin-muxing selection for GPIO55" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Defines pin-muxing selection for GPIO56" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Defines pin-muxing selection for GPIO57" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Defines pin-muxing selection for GPIO58" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Defines pin-muxing selection for GPIO59" begin="23" end="22" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBCSEL1" width="32" page="1" offset="0x68" internal="0" description="GPIO B Master Core Select (GPIO32 to GPIO39)">
		<bitfield id="GPIO32" description="GPIO32 Master CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO33" description="GPIO33 Master CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO34" description="GPIO34 Master CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO35" description="GPIO35 Master CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO37" description="GPIO37 Master CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO39" description="GPIO39 Master CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPBCSEL2" width="32" page="1" offset="0x6a" internal="0" description="GPIO B Master Core Select (GPIO40 to GPIO47)">
		<bitfield id="GPIO40" description="GPIO40 Master CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO41" description="GPIO41 Master CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO42" description="GPIO42 Master CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO43" description="GPIO43 Master CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO44" description="GPIO44 Master CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO45" description="GPIO45 Master CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO46" description="GPIO46 Master CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO47" description="GPIO47 Master CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPBCSEL3" width="32" page="1" offset="0x6c" internal="0" description="GPIO B Master Core Select (GPIO48 to GPIO55)">
		<bitfield id="GPIO48" description="GPIO48 Master CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO49" description="GPIO49 Master CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO50" description="GPIO50 Master CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO51" description="GPIO51 Master CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO52" description="GPIO52 Master CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO53" description="GPIO53 Master CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO54" description="GPIO54 Master CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO55" description="GPIO55 Master CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
