IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_gpio_ctrl_regs.xml
	<register id="GPBCSEL4" width="32" page="1" offset="0x6e" internal="0" description="GPIO B Master Core Select (GPIO56 to GPIO63)">
		<bitfield id="GPIO56" description="GPIO56 Master CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO57" description="GPIO57 Master CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO58" description="GPIO58 Master CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO59" description="GPIO59 Master CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="GPBLOCK" width="32" page="1" offset="0x7c" internal="0" description="GPIO B Lock Register (GPIO32 to GPIO63)">
		<bitfield id="GPIO32" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBCR" width="32" page="1" offset="0x7e" internal="0" description="GPIO B Lock Commit Register (GPIO32 to GPIO63)">
		<bitfield id="GPIO32" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCTRL" width="32" page="1" offset="0x1c0" internal="0" description="GPIO H Qualification Sampling Period (GPIO224 to GPIO255)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO224 to GPIO231" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO232 to GPIO239" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO240 to GPIO247" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL1" width="32" page="1" offset="0x1c2" internal="0" description="GPIO H Qualification Type (GPIO224 to GPIO239)">
		<bitfield id="GPIO224" description="Select input qualification type for this GPIO Pin" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Select input qualification type for this GPIO Pin" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Select input qualification type for this GPIO Pin" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Select input qualification type for this GPIO Pin" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Select input qualification type for this GPIO Pin" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Select input qualification type for this GPIO Pin" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Select input qualification type for this GPIO Pin" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Select input qualification type for this GPIO Pin" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Select input qualification type for this GPIO Pin" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Select input qualification type for this GPIO Pin" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Select input qualification type for this GPIO Pin" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Select input qualification type for this GPIO Pin" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Select input qualification type for this GPIO Pin" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Select input qualification type for this GPIO Pin" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL2" width="32" page="1" offset="0x1c4" internal="0" description="GPIO H Qualification Type (GPIO240 to GPIO255)">
		<bitfield id="GPIO240" description="Select input qualification type for this GPIO Pin" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Select input qualification type for this GPIO Pin" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Select input qualification type for this GPIO Pin" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Select input qualification type for this GPIO Pin" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Select input qualification type for this GPIO Pin" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Select input qualification type for this GPIO Pin" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHPUD" width="32" page="1" offset="0x1cc" internal="0" description="GPIO H Pull-Up Disable (GPIO224 to GPIO255) ">
		<bitfield id="GPIO224" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHINV" width="32" page="1" offset="0x1d0" internal="0" description="GPIO H Input Inversion (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHAMSEL" width="32" page="1" offset="0x1d4" internal="0" description="GPIO H Analog Mode Select (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Analog Mode select for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Analog Mode select for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Analog Mode select for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Analog Mode select for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Analog Mode select for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Analog Mode select for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Analog Mode select for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Analog Mode select for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Analog Mode select for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Analog Mode select for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Analog Mode select for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Analog Mode select for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Analog Mode select for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Analog Mode select for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Analog Mode select for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Analog Mode select for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Analog Mode select for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Analog Mode select for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Analog Mode select for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Analog Mode select for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Analog Mode select for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Analog Mode select for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Analog Mode select for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Analog Mode select for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
