IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_gpio_ctrl_regs.xml
	<register id="GPHLOCK" width="32" page="1" offset="0x1fc" internal="0" description="GPIO H Lock Register (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCR" width="32" page="1" offset="0x1fe" internal="0" description="GPIO H Lock Commit Register (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
</module>
